old-test/PastebinTesterComp/src/jbiServiceUnits/PastebinTester/PastebinTesterWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="PastebinTesterWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/PastebinTester/src/PastebinTesterWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/PastebinTester/src/PastebinTesterWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="PastebinTesterWSDLOperationRequest">
        <part name="text" type="xsd:string"/>
    </message>
    <message name="PastebinTesterWSDLOperationResponse">
        <part name="status" type="xsd:string"/>
    </message>
    <portType name="PastebinTesterWSDLPortType">
        <operation name="PastebinTesterWSDLOperation">
            <input name="input1" message="tns:PastebinTesterWSDLOperationRequest"/>
            <output name="output1" message="tns:PastebinTesterWSDLOperationResponse"/>
        </operation>
    </portType>
    <binding name="PastebinTesterWSDLBinding" type="tns:PastebinTesterWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="PastebinTesterWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/PastebinTester/src/PastebinTesterWSDL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/PastebinTester/src/PastebinTesterWSDL"/>
            </output>
        </operation>
    </binding>
    <service name="PastebinTesterWSDLService">
        <port name="PastebinTesterWSDLPort" binding="tns:PastebinTesterWSDLBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/PastebinTesterWSDLService/PastebinTesterWSDLPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="PastebinTesterWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="PastebinTesterWSDLPortTypeRole" portType="tns:PastebinTesterWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
