PastebinTesterComp/test/Test/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pas="http://j2ee.netbeans.org/wsdl/PastebinTester/src/PastebinTesterWSDL">
  <soapenv:Body>
    <pas:PastebinTesterWSDLOperation>
      <text>ciao</text>
    </pas:PastebinTesterWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>